# GetCurrentElements Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MemberForcesServiceData..::..GetCurrentElements Method
MemberForcesServiceData Class See Also
---
Returns the list of Ids of the current elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<ElementId> GetCurrentElements()
```

Visual Basic
---
```text
Public Function GetCurrentElements As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetCurrentElements()
```

# ### Return Value
Ids of the current elements. Contains the family base element to which the Member Forces parameters belongs.
# See Also
MemberForcesServiceData Class
Autodesk.Revit.DB.Structure Namespace